project/src/Catalogs/ПравилаКонвертацииПредопределенныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииПредопределенныхДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьГруппыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Захвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриЗагрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурацииКорреспондент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТегВырезки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииПредопределенныхДанных/Forms/ФормаЭлементаXDTO/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ (Объект.ИспользоватьДляОтправки ИЛИ Объект.ИспользоватьДляПолучения) Тогда
		Объект.ИспользоватьДляОтправки = Истина;
	КонецЕсли;
	
	// Заполнение списка конвертаций данного правила.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций, ВедущаяКонфигурация);
	Иначе
		Если ЗначениеЗаполнено(Параметры.Конвертация) Тогда
			СписокКонвертаций.Добавить(Параметры.Конвертация);
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Конвертация, "ТипКонвертации, Конфигурация");

			Объект.ТипКонвертации = ДанныеКонвертации.ТипКонвертации;
			ВедущаяКонфигурация = ДанныеКонвертации.Конфигурация;
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Возможно новый элемент копируется - тогда список конвертаций необходимо заполнить.
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Параметры.ЗначениеКопирования, СписокКонвертаций, ВедущаяКонфигурация);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
			Объект.ГруппаПравил = Параметры.ГруппаПравил;
		КонецЕсли;		
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ОпределитьИспользованиеТегов(СписокКонвертаций, ЕстьТеги, Элементы.ТегиТег);
	Элементы.СопоставлениеЗначенийТегВырезки.ПараметрыВыбора = Элементы.ТегиТег.ПараметрыВыбора;

	ЗаполнитьСпискиОбъектов();
	ЗаполнитьСпискиЗначений(Истина, Истина);
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("НомерСтрокиПКЗ") И ЗначениеЗаполнено(Параметры.НомерСтрокиПКЗ) Тогда
		Элементы.СопоставлениеЗначений.ТекущаяСтрока = Объект.СопоставлениеЗначений[Параметры.НомерСтрокиПКЗ-1];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПеречитатьСлужебныеПеременныеФормы();
	НастроитьСпискиВыбораОбъектов();
	НастроитьСпискиВыбораЗначений(Истина, Истина); 
	Элементы.ГруппаТеги.Видимость = ЕстьТеги; 
	Элементы.СопоставлениеЗначенийТегВырезки.Видимость = ЕстьТеги;
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонвертацияДанныхXDTOВызовСервера.ПроверитьВозможностьЗаписиПравила(Отказ, ТекущийОбъект, Ложь);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Для нового правила создать запись в регистре
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(Объект.Ссылка, СписокКонвертаций);
	СписокКонвертацийКДобавлению = КонвертацияДанныхXDTOВызовСервера.ПолучитьДополненныйСписокКонвертаций(Объект.Ссылка, СписокКонвертаций)
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если СписокКонвертацийКДобавлению.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОДобавленииВСоставКонвертаций", ЭтаФорма);
		КонвертацииКДобавлениюСтрокой = " ";
		Для Каждого ТекКонвертация Из СписокКонвертацийКДобавлению Цикл
			КонвертацииКДобавлениюСтрокой = КонвертацииКДобавлениюСтрокой + СокрЛП(ТекКонвертация.Значение) + ",";
		КонецЦикла;
		КонвертацииКДобавлениюСтрокой = Лев(КонвертацииКДобавлениюСтрокой, СтрДлина(КонвертацииКДобавлениюСтрокой)-1) + "?";
		ТекстВопроса = НСтр("ru='Включить правило в состав конвертаций:'") + КонвертацииКДобавлениюСтрокой;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Закрыта форма вопроса о составе конвертаций с изменением состава.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораНаСервере();
		ОбновитьОтображениеДанных();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Изменился состав конвертаций.
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		ПриОткрытии(Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Тумблер_ОбластьПримененияПриИзменении(Элемент)
	Если ОбластьПрименения = 0 Тогда
		Объект.ИспользоватьДляОтправки = Истина;
		Объект.ИспользоватьДляПолучения = Ложь;
	ИначеЕсли ОбластьПрименения = 1 Тогда
		Объект.ИспользоватьДляОтправки = Ложь;
		Объект.ИспользоватьДляПолучения = Истина;
	Иначе
		Объект.ИспользоватьДляОтправки = Истина;
		Объект.ИспользоватьДляПолучения = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииПриИзменении(Элемент)
	ЗаполнитьСпискиЗначений(Истина, Ложь);
	НастроитьСпискиВыбораЗначений(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектФорматаПриИзменении(Элемент)
	ЗаполнитьСпискиЗначений(Ложь, Истина);
	НастроитьСпискиВыбораЗначений(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеЗначенийПередНачаломИзменения(Элемент, Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектКонфигурации) ИЛИ НЕ ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		ТекстПредупреждения = НСтр("ru = 'Не указан объект конфигурации или объект формата'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектФорматаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("МассивКонвертаций, ТекущаяСтрока, РежимРаботы", 
					СписокКонвертаций, Объект.ОбъектФормата, "ОбъектФормата");
	ПараметрыФормыВыбора.Вставить("ДляПКПД", Истина);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектФормата", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура ОбъектКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("МассивКонвертаций, ТекущаяСтрока, РежимРаботы", 
					СписокКонвертаций, Объект.ОбъектКонфигурации, "ОбъектКонфигурации");
	ПараметрыФормыВыбора.Вставить("ДляПКПД", Истина);
	ПараметрыФормыВыбора.Вставить("ВедущаяКонфигурация", ВедущаяКонфигурация);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектКонфигурации", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЭлементВСоставКонвертации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать правило конвертации предопределенных данных'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранаКонвертация", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.ФормаВыбора",, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)
	АвтоСопоставлениеЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификатор(Команда)
	Постфикс = "";
	Если НЕ (ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Или ЗначениеЗаполнено(Объект.ОбъектФормата)) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
		Код = СокрЛП(Объект.ОбъектКонфигурации);
	Иначе
		Код = СокрЛП(Объект.ОбъектФормата);
	КонецЕсли;
	Если НЕ (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
		Постфикс = ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	Код = СтрЗаменить(Код, "Ссылка", "");
	Код = СтрЗаменить(Код, ".", "_");
	Объект.Код = Код + Постфикс;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	ОтказДобавления = Ложь;
	ДополнитьСоставКонвертации(РезультатЗакрытия, Объект.Ссылка, ОтказДобавления);
	Если ОтказДобавления Тогда
		ТекстПредупреждения = НСтр("ru = 'Данный элемент уже входит в состав выбранной конвертации'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	Если ТипЗнч(Конвертация) = Тип("СписокЗначений") Тогда
		Для Каждого ТекКонвертация Из Конвертация Цикл
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ТекКонвертация.Значение, ЭлементКонвертации);
		КонецЦикла;
	Иначе
		// Проверка на дубли
		Если КонвертацияДанныхXDTOВызовСервера.ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Тогда
			ОтказДобавления = Истина;
			Возврат;
		КонецЕсли;
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации);
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиОбъектов()
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	ОбластьПримененияСписка = Новый Структура("ДляПКО, ДляПКПД, ДляПРО", Ложь, Истина, Ложь);
	Конфигурации = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций);
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(СписокОбъектовКонфигурации, Конфигурации,ОбластьПримененияСписка);
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(СписокОбъектовФормата, МассивКонвертаций,, Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиЗначений(ДляЗначенийКонфигурации, ДляЗначенийФормата)
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	Если ДляЗначенийКонфигурации Тогда
		Конфигурации = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций);
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокЗначенийКонфигурации(СписокЗначенийКонфигурации, Конфигурации, Объект.ОбъектКонфигурации);
	КонецЕсли;
	Если ДляЗначенийФормата Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокЗначенийФормата(СписокЗначенийФормата, МассивКонвертаций, Объект.ОбъектФормата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораОбъектов()
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектКонфигурации, СписокОбъектовКонфигурации);
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектФормата, СписокОбъектовФормата);
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораЗначений(ДляЗначенийКонфигурации, ДляЗначенийФормата)
	Если ДляЗначенийКонфигурации Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеЗначений.ПодчиненныеЭлементы.СопоставлениеЗначенийЗначениеКонфигурации,
			СписокЗначенийКонфигурации);
	КонецЕсли;
	Если ДляЗначенийФормата Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеЗначений.ПодчиненныеЭлементы.СопоставлениеЗначенийЗначениеФормата,
			СписокЗначенийФормата);
	КонецЕсли;
	ОбновитьОтображениеДанных();

КонецПроцедуры


&НаКлиенте
Процедура ВыбранОбъектФормата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Объект.ОбъектФормата = РезультатЗакрытия;
	ОбъектФорматаПриИзменении(Элементы.ОбъектФормата);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Объект.ОбъектКонфигурации = РезультатЗакрытия.Ссылка;
	Иначе
		Объект.ОбъектКонфигурации = РезультатЗакрытия;
	КонецЕсли;
	ОбъектКонфигурацииПриИзменении(Элементы.ОбъектКонфигурации);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	ЗаполнитьСпискиОбъектов();
	ЗаполнитьСпискиЗначений(Истина, Истина);
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьСлужебныеПеременныеФормы()
	Если Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения Тогда
		ОбластьПрименения = 2;
	ИначеЕсли Объект.ИспользоватьДляПолучения Тогда
		ОбластьПрименения = 1;
	Иначе
		ОбластьПрименения = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросОДобавленииВСоставКонвертаций(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОтказДобавления = Ложь;
		ДополнитьСоставКонвертации(СписокКонвертацийКДобавлению, Объект.Ссылка, ОтказДобавления);
		СписокКонвертацийКДобавлению.Очистить();
		Если НЕ ОтказДобавления Тогда
			Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура АвтоСопоставлениеЗначений()
	ТабСопоставленные = Объект.СопоставлениеЗначений.Выгрузить();
	Для Каждого ЗначениеКонф Из СписокЗначенийКонфигурации Цикл
		Если ТабСопоставленные.Найти(ЗначениеКонф.Значение, "ЗначениеКонфигурации") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СписокЗначенийФормата.НайтиПоЗначению(ЗначениеКонф.Значение) <> Неопределено Тогда
			НовСопоставление = Объект.СопоставлениеЗначений.Добавить();
			НовСопоставление.ЗначениеКонфигурации = ЗначениеКонф.Значение;
			НовСопоставление.ЗначениеФормата = ЗначениеКонф.Значение;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
#КонецОбласти
